{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Mill",
    "description": "",
    "home_page_url": "https://mill.plainopen.com",
    "feed_url": "https://mill.plainopen.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Dmitry Sagalovskiy"
    },
    "items": [
        {
            "id": "https://mill.plainopen.com/how-we-share-secrets-at-a-fully-remote-startup.html",
            "url": "https://mill.plainopen.com/how-we-share-secrets-at-a-fully-remote-startup.html",
            "title": "How we share secrets at a fully-remote startup",
            "summary": "<header>\n<p>Here’s the situation: a small, fully-remote software team works on a service (let’s say Grist), and to run it, they need a secret key...</p>\n",
            "content_html": "\n<p class=\"msg--highlight msg msg--info\">Appeared originally at <a href=\"https://www.getgrist.com/blog/how-we-share-secrets-at-a-fully-remote-startup/\">https://www.getgrist.com/blog/how-we-share-secrets-at-a-fully-remote-startup/</a> on 2024-07-16.</p>\n</header>\n<p>Here’s the situation: a small, fully-remote software team works on a service (let’s say <a href=\"https://www.getgrist.com/\">Grist</a>), and to run it, they need a secret key (let’s say an API key for OpenAI<sup><a href=\"#footnote_1\">(1)</a></sup>).</p>\n<p>I, the co-CEO, signed up for the OpenAI account and generated an API key. Now I want to share it with my CTO, who is in charge of getting the feature out to production.</p>\n<p>We work remotely. We talk on Slack, or <a href=\"https://www.kumospace.com/\">Kumospace</a>, or Zoom, or even email. Do I want the secret in any of these channels? Nope.</p>\n<p>I like to think of myself as security conscious: careful about privacy, passwords, encryption. (Please don’t take that as an invitation to target me for hacking.) And on a few occasions — enough for this to feel like it’s becoming a theme — I’ve <em><a href=\"https://security.stackexchange.com/questions/18197/why-shouldnt-we-roll-our-own\" target=\"_blank\" rel=\"noopener noreferrer\">rolled my own security</a></em>. Sort of.</p>\n<h4>Don’t roll your own security</h4>\n<p>Like many hard areas of human knowledge, security/cryptography is one where the more you know, the more you realize you don’t know.</p>\n<p>I am not a security expert. But once upon a time, I did take a graduate level Randomized Algorithms class, which was mostly on cryptographic algorithms, from <a href=\"https://en.wikipedia.org/wiki/Michael_O._Rabin\">Michael Rabin</a> — one of the pioneers of public-key cryptography. Another class was a graduate level seminar on Elliptic Curves (the math behind <a href=\"https://en.wikipedia.org/wiki/Elliptic-curve_cryptography\">Elliptic-curve cryptography</a>). Not that I remember much of either – I’m brandishing these credentials to give you at least a bit of confidence that I do in fact realize how much I don’t know.</p>\n<p>Both security and cryptography are easier to mess up than to get right. If you mess up any part, everything breaks. And broken security is worse than useless, it’s dangerous. You’ll be <em>less</em> safe relying on it than if you didn’t rely on it at all. Don’t roll your own!</p>\n<h4>Encrypting secrets</h4>\n<p>And with that in mind, let’s move towards breaking this advice.</p>\n<p>Are there clever tools built to share secrets in a completely encrypted safe way? Yes, there are.<sup><a href=\"#footnote_2\">(2)</a></sup> But we are not <a href=\"https://scoop4c.eu/cases/estonian-public-key-infrastructure\">in Estonia</a>, and to rely on a tool, I’d have to trust it. Is that really different from just trusting Slack?</p>\n<p>So I scratched my head, and decided that there are some tools I do trust already. I trust my computer, and my CTO’s computer, mostly because I have to. The task would be impossible if I didn’t. And I trust low-level tools already installed on our computers. One of them is <a href=\"https://nodejs.org/\">Node.js</a>. Node.js is JavaScript for the server, and runs happily from the command line in a terminal.</p>\n<p>So I asked myself: if I just limit my trust to Node.js, is that enough to share a secret?</p>\n<p>Yes! But I need a bit of software — some JavaScript code — that would run in Node.js to encrypt/decrypt my secret. I could look for something to download, or I could write my own. Either way, if I don’t want to trust it, I want to be able to read and understand it. Luckily, what Node.js has built-in (and what I’ve already decided I will trust) is enough that the extra code is small.</p>\n<p>I wrote a small JS script run using Node.js from a terminal. Initially it was 46 lines, though now it’s 72 with support for larger secrets. <a href=\"https://github.com/gristlabs/secrets.js/blob/main/secrets.js\">It’s also on GitHub</a>. You can read it and understand it.</p>\n<figure class=\"post__image post__image--center\" ><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://mill.plainopen.com/media/posts/3/code-3.png\" alt=\"Full code of the script\" width=\"366\" height=\"696\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://mill.plainopen.com/media/posts/3/responsive/code-3-xs.png 640w ,https://mill.plainopen.com/media/posts/3/responsive/code-3-sm.png 768w ,https://mill.plainopen.com/media/posts/3/responsive/code-3-md.png 1024w ,https://mill.plainopen.com/media/posts/3/responsive/code-3-lg.png 1366w ,https://mill.plainopen.com/media/posts/3/responsive/code-3-xl.png 1600w ,https://mill.plainopen.com/media/posts/3/responsive/code-3-2xl.png 1920w\"></figure>\n<figcaption >Pictured: all the code</figcaption>\n</figure>\n<h4>Let’s walk through it</h4>\n<ol>\n<li>The main workhorse is the Node <a href=\"https://nodejs.org/api/crypto.html\">crypto</a> module. So no, I didn’t roll my own cryptography.</li>\n<li>Then we have the <code>main()</code> function. When run with no arguments in a terminal, it helpfully prints out all available commands:\n<pre class=\"language-bash\"><code>$ ./secrets.js\nUsage:\n      ./secrets.js encrypt RECIPIENT_KEYFILE.pub &lt; PLAINTEXT_FILE\n      ./secrets.js decrypt MY_KEYFILE.priv &lt; ENCRYPTED_FILE\n      ./secrets.js genkey MY_KEYFILE</code></pre>\n</li>\n<li>Continuing with <code>main()</code>, we check if the command is <code>encrypt</code>. If so, read the public key and the plaintext file.</li>\n<li>Encryption is almost fully provided by the <code>crypto</code> module:\n<pre class=\"language-javascript\"><code>crypto.publicEncrypt({key, padding}, plaintext).toString('base64')</code></pre>\nWe just have to pick the parameters (<code>padding</code>), and encode the result into text that’s easy to copy/paste.</li>\n<li>But life isn’t so simple. This only works for very small inputs (OK for a short API key, not enough for an SSL certificate). If the input is too large, we do the typical thing public-key cryptography does:\n<ol>\n<li>Generate a small key for symmetric encryption on the fly.</li>\n<li>Encrypt the long input using that key.</li>\n<li>Put together the symmetric key (encrypted using the recipient’s public key) and the input (encrypted with the symmetric key). You can see how having the recipient’s private key would unlock the symmetric key, which would in turn unlock the data.</li>\n</ol>\n</li>\n<li>Now we’re getting dangerously close to rolling our own, even though this logic is just 7 lines of code. There are more parameters (size of symmetric key, symmetric encryption algorithm, initialization vector), and there’s the question of whether our approach is right. There are multiple options that would work fine, but it’s possible to get it wrong, which would be worse than skipping the project altogether. I won’t lie: the parameters are not obvious, or even well-documented (either in Node’s <code>crypto</code>, or in OpenSSL that it uses under the hood). I did research on this, however, and recommend you do your own if you have doubts.</li>\n<li>Continuing with <code>main()</code>, it then handles the <code>decrypt</code> command. It does all the steps of <code>encrypt</code> in reverse.</li>\n<li>The last bit is the <code>genkey</code> command for creating the key-pair: <code>crypto</code> once again provides the <code>generateKeyPair</code> function for that. We just pick suitable parameters to call it with. We save the files containing the public and private keys, and reduce permissions on the private key to make it readable only by you.</li>\n</ol>\n<p>That’s it! Public-key cryptography for this simple use case:</p>\n<ol>\n<li>The recipient generates a key-pair (<code>genkey</code>), holds on to the private key, and shares freely the public key. The keys are just files on your computer.</li>\n<li>The sender uses the recipient’s public key (<code>RECIPIENT_KEYFILE.pub</code> above) to encrypt a secret (“plaintext” in crypto-speak). The encrypted block of text (ciphertext) is safe to share over an untrusted channel.</li>\n<li>The recipient uses their private key (<code>MY_KEYFILE.priv</code> above) to decrypt it. No one else has the private key, and no one can decrypt the ciphertext without it.</li>\n</ol>\n<figure class=\"post__image post__image--center\" ><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://mill.plainopen.com/media/posts/3/sisyphus-2.jpeg\" alt=\"Sisiphus being crushed by his stone\" width=\"600\" height=\"395\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-xs.jpeg 640w ,https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-sm.jpeg 768w ,https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-md.jpeg 1024w ,https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-lg.jpeg 1366w ,https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-xl.jpeg 1600w ,https://mill.plainopen.com/media/posts/3/responsive/sisyphus-2-2xl.jpeg 1920w\"></figure>\n<figcaption ><span style=\"color: #34495e;\">Sisyphus “rolling his own”.</span> <span style=\"color: #7e8c8d;\">(Image source: <a href=\"https://commons.wikimedia.org/wiki/File:Sisyphus_-_Le_Roman_de_la_Rose.jpeg\" target=\"_blank\" rel=\"noreferrer noopener\" style=\"color: #7e8c8d;\">Wikimedia Commons</a>)</span></figcaption>\n</figure>\n<h4>Did we roll our own security?</h4>\n<p>No, not really. Our solution uses and trusts a lot of cryptography code from good sources: Node.js, its <code>crypto</code> module, and the <a href=\"https://www.openssl.org/\">OpenSSL</a> library it’s based on. These are respected, well-maintained, commonly-used open-source tools, which get plenty of attention from security researchers.</p>\n<p>The code we did write, which makes a number of choices about <em>how</em> this cryptography is used, is still sensitive security code. That’s risky. The main protection here is that it’s so small that any software engineer can read and understand it. To me what matters is that <em>I</em> can read and understand it.</p>\n<p>I find this an interesting compromise. It feels as secure as I can imagine any software to be, and it allows Grist Labs to share technical secrets remotely. For non-technical secrets (like next month’s book club selection), Slack works fine. For now…</p>\n<hr>\n<div class=\"footnote\">\n<p id=\"footnote_1\">(1) We use <a href=\"https://platform.openai.com/\">OpenAI</a> for Grist’s <a href=\"https://www.getgrist.com/ai-formula-assistant/\">AI Formula Assistant</a>, but without sending data from your document, only its structure.</p>\n<p id=\"footnote_2\">(2) There are plenty of <a href=\"https://www.reddit.com/r/devops/comments/tofkfs/how_do_you_send_secrets_to_other_people/\" target=\"_blank\" rel=\"noreferrer noopener\">other opinions on this problem</a>. But there’s also this (paraphrased) conversation I had with a colleague after showing them a draft of this post, which brings us back full circle:</p>\n<p><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“If we’re bothering with encryption and keypairs, why not just PGP?”</em></p>\n<p><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“That’s still software I have to trust and install. In fact, I just tried, and got lost immediately. I found OpenPGP which has a half-dozen email-related packages for MacOS (didn’t try: proprietary/paid, and all about specific email clients that I don’t need), and found GPG which has two installers for Mac. I tried one, and it needs root access to install itself. Why would I give some software root access just to encrypt a secret? It certainly doesn’t increase my trust in it.”</em></p>\n<p><em style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">“I guess what this answer points out, once again, is that GPG has a usability problem… So bad that it’s easier to create a short script in Node.js to do one of its core features.”</em></p>\n</div>",
            "author": {
                "name": "Dmitry Sagalovskiy"
            },
            "tags": [
                   "security",
                   "javascript",
                   "cryptography",
                   "algorithms"
            ],
            "date_published": "2025-01-29T00:47:55-05:00",
            "date_modified": "2025-01-30T22:44:13-05:00"
        },
        {
            "id": "https://mill.plainopen.com/why-sorting-is-harder-than-it-seems.html",
            "url": "https://mill.plainopen.com/why-sorting-is-harder-than-it-seems.html",
            "title": "Why sorting is harder than it seems",
            "summary": "<header>\n<p>This story is about sorting arrays. I am telling it because sorting continues to surprise me with delightful bugs. Frustrating too, but also delightful. First, some context...</p>\n",
            "content_html": "\n<p class=\"msg--highlight msg msg--info\">Appeared originally at <a href=\"https://www.getgrist.com/blog/why-sorting-is-harder-than-it-seems/\">https://www.getgrist.com/blog/why-sorting-is-harder-than-it-seems/</a> on 2023-02-09.</p>\n</header>\n<p>This story is about sorting arrays. I am telling it because sorting continues to surprise me with delightful bugs. Frustrating too, but also delightful.</p>\n<p>First, some context. I’ve been working for years on a spreadsheet-database tool called <a href=\"https://www.getgrist.com/\">Grist</a>. Naturally, it lets users sort data. There are some complications, such as letting users sort by multiple columns. Also, a column may contain different types of values: for instance, mostly numbers but with some cells that are empty or that contain a string like “N/A” or “TBD”.</p>\n<p>Normally, sorting happens in Javascript, on data that’s already in the browser. So this post is mainly about sorting in Javascript, although the most important points are not language-specific <sup><a href=\"#fn4\">(4)</a></sup>.</p>\n<h3 id=\"h-default-javascript-sort\">Default JavaScript Sort</h3>\n<p>We don’t need a complex example to start scratching our heads:</p>\n<pre class=\"language-javascript\"><code>[10, 2, 'x'].sort() // -&gt; produces [ 10, 2, 'x' ]</code></pre>\n<p>This should not surprise you. We didn’t really say what we expect from mixing strings and numbers. Should <code>'a'</code> come before <code>2</code> or after? Well, Javascript has a particular answer for us: it always sorts all items as strings. The result we see is alphabetically sorted, according to the order we’d get from converting each item to a string.</p>\n<p>This is bad for a spreadsheet. We <em>really</em> expect 2 to come before 10.</p>\n<h3 id=\"h-comparators\">Comparators</h3>\n<p>Luckily, Javascript gives us a way to fix this: pass in a <em>comparator</em> function that defines the sort order <a href=\"#fn1\"><sup>(1)</sup></a>. Javascript expects this function to take two values, say, <code>a</code> and <code>b</code>, and return something negative when <code>a &lt; b</code>, something positive when <code>a &gt; b</code>, and 0 when <code>a</code> and <code>b</code> should be considered equivalent.</p>\n<p>Most instructions for using <code>sort()</code> provide a helpful comparator function for sorting numbers:</p>\n<pre class=\"language-javascript\"><code>function compareNumbers(a, b) {  return a - b;}</code></pre>\n<p>Indeed, it satisfies the requirements: the returned value is negative, positive, or zero in all the right cases. Let’s give it a try:</p>\n<pre class=\"language-javascript\"><code>[10, 2, 'x' ].sort(compareNumbers)     // -&gt; produces [ 2, 10, 'x' ]</code></pre>\n<p>Whew, you sigh! This looks correct, and was easy enough. Right? No, this would be too easy. Look at the result if we reverse two values in the original array:</p>\n<pre class=\"language-javascript\"><code>[10, 'x' , 2].sort(compareNumbers)     // -&gt; produces [ 10, 'x', 2 ]</code></pre>\n<p>This is not at all correct. It is even more upsetting that it’s even possible to get different answers.</p>\n<p>Let’s think why this happened? Well, our comparator’s key operation is <code>a - b</code>. It makes sense for numbers, but not for the string <code>'x'</code>. In fact, when comparing a number to a string, it returns <code>NaN</code>. Maybe that’s the problem. We were told to return positive, negative, or 0, not <code>NaN</code>.</p>\n<p>Let’s fix our comparator function. Here is a versatile one:</p>\n<pre class=\"language-javascript\"><code>function nativeCompare(a, b) {\n  return (a &lt; b ? -1 : (a &gt; b ? 1 : 0));\n}</code></pre>\n<p>In fact, it’s used a lot in Grist. It’s perfectly valid to compare <code>'x' &lt; 2</code>, there is no exception, and we always return a valid comparator value: never <code>NaN</code>. This one has got to work. Right?</p>\n<pre class=\"language-javascript\"><code>[10, 2, 'x'].sort(nativeCompare)     // -&gt; [ 2, 10, 'x' ]\n[10, 'x', 2].sort(nativeCompare)     // -&gt; [ 10, 'x', 2 ]</code></pre>\n<p>No, don’t tell me. The same exact terrible result as last time.</p>\n<h3 id=\"h-transitivity\">Transitivity</h3>\n<p>If you read far enough in the documentation of <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/sort#description\" target=\"_blank\" rel=\"noreferrer noopener\">sort on MDN</a>, you’ll find some more requirements that the comparator function needs to fulfill. Let’s see how our <code>nativeCompare</code> does on these requirements:</p>\n<ul>\n<li>✔️ It is <em>pure</em>: no side-effects of calling it.</li>\n<li>✔️ It is <em>stable</em>: it returns the same result for the same inputs.</li>\n<li>✔️ It is <em>reflexive</em>: it returns 0 when called with two of the same value (certainly for the values in our example).</li>\n<li>❓ Is it <em>anti-symmetric</em>? Calling it for (a, b) or (b, a) should produce opposite signs. We should check.</li>\n<li>❓ Is it <em>transitive</em>? If a &lt; b and b &lt; c, does it guarantee a &lt; c? We should check.</li>\n</ul>\n<p>These form the definition of something called a <em>strict weak order </em><sup><a href=\"#fn2\">(2)</a></sup>. All that means is that “the order makes sense”. The fact that it’s not an obvious thing is what makes sorting bugs fun (and frustrating).</p>\n<p>Our <code>nativeCompare</code> function really just repackages the behavior of the standard Javascript “less-than” and “greater-than” operators. Do those define an order that makes sense?</p>\n<p>These operators are described in great detail here: <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Less_than\" target=\"_blank\" rel=\"noreferrer noopener\">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Less_than</a>. Good luck figuring out what to expect. To save you some work, no, they do not define an order that “makes sense”. That’s because:</p>\n<pre class=\"language-javascript\"><code>  1 &lt; \"2\"  // true\n\"2\" &lt; \"a\"  // true\n  1 &lt; \"a\"  // false; broken transitivity!</code></pre>\n<p>Or with the values from our example:</p>\n<pre class=\"language-javascript\"><code>  2 &lt; 'x'  // false\n'x' &lt; 10   // false\n  2 &lt; 10   // true</code></pre>\n<p>This is a fail. By the standard of “makes sense”, the first two say that <code>2 &gt;= 'x'</code> and <code>'x' &gt;= 10</code>, and the third says <code>2 &lt; 10</code>, the opposite of what transitivity <em>should</em> give us.</p>\n<p>Translating it to <code>nativeCompare</code> makes this a bit more precise:</p>\n<pre class=\"language-javascript\"><code>nativeCompare(2, 'x')    // 0 (they are \"equivalent\")\nnativeCompare('x', 10)   // 0 (they are \"equivalent\")\nnativeCompare(2, 10)     // -1 (doh!)</code></pre>\n<p>This is a fail of transitivity.</p>\n<h3 id=\"h-but-why-is-sort-so-fickle\">But why is sort so fickle?</h3>\n<p>At this point, maybe it’s good to step back and say: transitivity-shmansitivity. All the operations are clearly correct for numbers. If we throw a string into the mix, we don’t really care if it ends up at the start or at the end. But why does it affect the relative order of the numbers? And why the inconsistency?</p>\n<p>To answer that, we need to remember the sorting algorithms. That’s a lovely topic. I remember learning them in AP Computer Science in high school, and in algorithms class in college. These days, there is little <em>need</em> to know them: every modern language has an efficient sorting function or method readily available. But there is satisfaction in understanding them, because they are beautiful gems of insight. <sup><a href=\"#fn3\">(3)</a></sup></p>\n<p>What’s worth remembering is that these are algorithms based on comparisons. They are fast because they minimize the number of comparisons. The efficient algorithms (including all the built-in implementations) make <em>O(N log N)</em> comparisons. This means that are optimally economical with comparisons.</p>\n<p>Why does it matter? Because if the algorithm has already noticed that <code>2</code> is “equivalent” to <code>'x'</code>, and that <code>'x'</code> is “equivalent” to <code>10</code>, then it’s not going to compare <code>2</code> and <code>10</code> at all. Transitivity, remember? It already knows that <code>2</code> is “equivalent” to <code>10</code>, without making the direct comparison.</p>\n<p>Think of binary search for a simpler example: you start by comparing a value to one in the middle of a sorted array. This single comparison determines which half to limit the rest of the search to. You’ll never compare your value to anything in the other half. You don’t have to because of transitivity.</p>\n<p>In short, with sorting, each comparison affects the result. So even a single violation of transitivity means that all bets are off. You <em>will</em> (guaranteed) find cases when your sort result is wrong.</p>\n<h3 id=\"h-i-will-have-order\">“I will have order!”</h3>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://mill.plainopen.com/media/posts/1/harry-potter-imelda-staunton-2.gif\" alt=\"\" width=\"498\" height=\"205\"></figure>\n<p>The only way to fix it is to fix transitivity and anti-symmetry.</p>\n<p>The basic idea is this:</p>\n<pre class=\"language-javascript\"><code>function typedCompare(a, b) {\n   return nativeCompare(typeof a, typeof b) || nativeCompare(a, b);\n}</code></pre>\n<p>The <code>||</code> operator is a shorthand for saying: return the value on the left, but when it’s 0, then return the one on the right. The left part compares types (e.g. <code>typeof 2</code> is <code>\"number\"</code>). If they are not equal, they determine the order of the values. So all numbers come before all strings (because <code>\"number\" &lt; \"string\"</code>). When types are equal, then we compare the values themselves. Comparisons actually are consistent when applied only to strings. They are also consistent when applied only to normal numbers (not <code>NaN</code> or <code>Infinity</code> though). So this solution will in fact work for any mix of strings and normal numbers:</p>\n<pre class=\"language-javascript\"><code>[10, 2, 'x'].sort(typedCompare)     // -&gt; [ 2, 10, 'x' ]\n[10, 'x', 2].sort(typedCompare)     // -&gt; [ 2, 10, 'x' ]</code></pre>\n<p>Grist has to deal with other values, like arrays, and with other sort options, like ascending / descending, “natural sort”, and “empty values last” option. Grist is open-source so you can find all this fancy logic written in code here: <a href=\"https://github.com/gristlabs/grist-core/blob/main/app/common/SortFunc.ts\" target=\"_blank\" rel=\"noreferrer noopener\">https://github.com/gristlabs/grist-core/blob/main/app/common/SortFunc.ts</a>.</p>\n<h3 id=\"h-ok-done-yet\">OK, done yet?</h3>\n<p>When I said sorting continues to surprise me, I meant it.</p>\n<p>The other day Grist had a fix landed for another sorting bug. For sorting empty values last, it had the following comparator function (simplified a bit for clarity):</p>\n<pre class=\"language-javascript\"><code>function emptyCompareBad(a, b) {\n  if (isEmpty(a)) {\n    return 1;\n  }\n  if (isEmpty(b)) {\n    return -1;\n  }\n  return 0;\n}</code></pre>\n<p>The idea is straightforward: if <code>a</code> is empty, we compare a as “greater” than <code>b</code>, to sort after it (right?). Otherwise, we look at <code>b</code>. If that’s empty, we compare <code>a</code> as “less” than <code>b</code>. Otherwise, they are equivalent, as far as their emptiness is concerned.</p>\n<p>No, in fact, this code was buggy. Here’s the fixed version. See if you can tell when it’s different:</p>\n<pre class=\"language-javascript\"><code>function emptyCompareGood(a, b) {\n  return nativeCompare(isEmpty(a), isEmpty(b));\n}\n\n// Recall what nativeCompare() is:\nfunction nativeCompare(a, b) {\n  return (a &lt; b ? -1 : (a &gt; b ? 1 : 0));\n}</code></pre>\n<p>Are these versions equivalent? Sometimes yes, but not if both <code>a</code> and <code>b</code> are empty. In that case, the comparator <em>should</em> return 0 to indicate equivalence, but the bad version was returning 1. Does that break transitivity? No, actually (at least I haven’t found that), but it breaks the <em>reflexive</em> and <em>anti-symmetric</em> properties. Ultimately, the bug showed up in combination with other comparators.</p>\n<p>Sorting in Grist is not perfect in other ways either. For instance, the values <code>NaN</code> and <code>Infinity</code> have the type <code>'number'</code> but don’t get checked specially. The only reason that’s not a visible bug in Grist is that these are rarely used and not really supported as cell values. But if you do manage to include them in a Grist document (e.g. as formula return values), you can easily recreate a sorting bug like the ones covered in this post.</p>\n<h3 id=\"h-in-conclusion\">In conclusion</h3>\n<p>Sorting in Javascript requires a <em>suitable</em> comparator. It is science, not art. You have to pay attention to the types you need to support. My recommendation is to stitch the comparator out of simpler comparators that you can have confidence in: the first one to return a non-zero value should win.</p>\n<p>If you make a mistake, it virtually guarantees that some arrays will sort incorrectly.</p>\n<p>All this is not actually specific to Javascript <sup><a href=\"#fn4\">(4)</a></sup>. It’s a general observation of sorting. If your values are a single type, then there is probably a suitable comparator you can already use. When you have to create a comparator of your own, all these lessons apply.</p>\n<hr>\n<p id=\"fn1\" class=\"footnote\">(1) There are several equivalent ways to define a sort order: C++ <a href=\"https://cplusplus.com/reference/algorithm/sort/\" target=\"_blank\" rel=\"noreferrer noopener\">standard library sort</a> favors a function like “less than” (which return true or false), while Javascript and Python favor “comparator” (which returns negative, positive, or 0 to indicate “less-than”, “greater-than”, or “equivalent”).</p>\n<p id=\"fn2\" class=\"footnote\">(2) I’ll link to Wikipedia article <a href=\"https://en.wikipedia.org/wiki/Weak_ordering#Strict_weak_orderings\" target=\"_blank\" rel=\"noreferrer noopener\">https://en.wikipedia.org/wiki/Weak_ordering#Strict_weak_orderings</a> but it looks painful to read even for an enthusiastic theoretical math major.</p>\n<p id=\"fn3\" class=\"footnote\">(3) The value in understanding algorithms is similar to the value in understanding the Pythagorean Theorem (and why it’s true), or understanding why we have seasons on this Earth. Not necessary, but satisfying.</p>\n<p id=\"fn4\" class=\"footnote\">(4) Some reactions to this post assumed Javascript is at fault. For string-number conversions, it is, but for all the sorting points, it's not. You'll get the same problems in any language if using an inconsistent comparator, for example when sorting an array of numbers that include NaNs. For example, in Python3, <code>sorted([10, math.nan, 2])</code>  produces <code>[10, nan, 2]</code>). In C++, <code>double arr[] = {5, NAN, 2, 10}; std::sort(arr, arr + 4);</code> produces <code>{2, nan, 10, 5}</code>.</p>",
            "author": {
                "name": "Dmitry Sagalovskiy"
            },
            "tags": [
                   "math",
                   "javascript",
                   "education",
                   "computer science",
                   "algorithms"
            ],
            "date_published": "2025-01-27T16:44:38-05:00",
            "date_modified": "2025-01-29T11:38:09-05:00"
        }
    ]
}
